Revit 2027 API
TextRange Constructor
 Constructs a TextRange with default values for start and length.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TextRange()
Public Sub New
public:
TextRange()
new : unit -> TextRange
Remarks
 The start and length are set to be 0 by default.
See Also
Reference
TextRange Class
TextRange Overload
Autodesk.Revit.DB Namespace